<?php
header('Content-Type:text/plain');
/* header('charset:utf-8'); */
switch($_GET['t']) {
case 1:
  echo '
在工作中寻求平衡及和谐，避免冲突  
有清楚程序，不能容忍环境中有太多的未知数  适应能力强，但会抗拒突如其来的转变  
对人对事的接受度颇高，在一般人心目中是个好的聆听者  遇到人际冲突的时候，会做[和事佬]  立场清晰，害怕被别人的意风所操控  
有时太过投入在细节中，不能集中精神去处理重要的事项  需要同事给予较多的响应和支持  
如果工作性质及环境适合，可以有高效的表现     
';
break;
case 2:
  echo '
如何识别型号：2  
是策划高手，也懂得将来自各方的意见及资料汇集  对很多的事情都感兴趣，享受崭新的经验  生命是一场极有趣的经历  
可以找到方法享受工作及享受同事之间的相处，讨厌刻板工作  倾向乐观，经常看到许多可能性  
懂得辅导、推动别人，但讨厌悲观及不分享自己热诚的人  
精于创造远见及开始新的工作项目，而没有兴趣参与真正工作  工作方式并不传统  
工作必须有创意，才能有出色的表现  不喜欢有太多的督促及直接的指示     
';
break;
case 3:
  echo '
如何识别型号：3   
坚强及能干  
立场院坚定，即使可能引致人际冲突，也不怕让人知道自己真正的感受  喜欢直截了当的沟通，讨厌转弯抹角说话兜转的人  就算不是刻意表现，也经常会做领袖的角色  
每个环境都需要有主持人，有必要时，会自动请缨扮演此角色  欣赏有真正领导能力的人。愿意追随  
 
相信直觉，也会凭直觉做出决定  
喜欢坐言起行，讨厌只讲不做或满腹理论没有实际行动的人  对同事相当慷慨及保护性强  
有时对同事遭受不公平待遇时，会仗义执言  有时对同事要求高  
自我肯定的态度令有些人觉得霸气或有威吓性  不介意别人是否喜欢自己然而必须受到尊重     
';
break;
case 4:
  echo '
如何识别型号：4   
对待同事处处表现关怀及支持  
与大多数人相处得很好，投射正面积极及友善的形象  遭遇人际冲突或被批评会产生不安的感觉  
有时矛盾来自一方面想取悦人，而另一方面又想跟随本身的意愿做事  可以轻易洞悉别人的才干和潜能  
必须小心对人付出太多，集中照顾人家面忽略本身的需要  有时对事情反应太过激烈而失去平衡  不擅于一个人做首领，会选择与人合作  不能够长时间独自工作，喜欢与人同处  
只要与身边的人合得来，工作情绪自然高涨     
';
break;
case 5:
  echo '
如何识别型号：5   
对自己、对人有很高的要求，倾向于挑剔  诚信及诚实是做人必具的元素  
不喜欢走快捷方式或者对工作不认真的人  
别人眼中看到自己倾向于批判及过度追求完美  有责任感、承诺感，事事做得最好  
期望别人有责任感，讨厌不肯承担责任的同事  
注重工作间整洁及有秩序，规条要清晰，不喜欢程序中有突然的转变  工作完成后才是嬉戏的时候，最大问题是不能放松  
可以接受公平的批判，但通常在别人开口之前已做了自我批判     
';
break;
case 6:
  echo '
如何识别型号：6   
重视成功，肯为成功付出最大的努力  尽力避免失败、障碍  具有强烈的目标感  
一有机会喜欢马上投入工作，不耐烦慢动作和[阻碍地球转]的人  不能明白为何有些人那么谨慎，事事都要细则地策划才付诸行动  富于自信，欢迎竞争  
是实用主义的信徒，为了提高效率，可以随时更改游戏规则  将工作放在家庭前面  
不喜欢拿时间出来轻松一下，也不喜欢花时间去建立人际关系     
';
break;
case 7:
  echo '
如何识别型号：7   
对公司忠心耿耿，希望生产高质素的工作  
采取行动前，必须对事情有透彻的了解，及预先设计了策略  精于预测问题和提供解决方案  
与不喜欢策划的人共事会有烦躁不安感觉  喜欢事事都有大前提作为指引  
过度的策划及了解有时会导致拖延  必须知道老板怎样评估自己  
不喜欢工作环境中有含糊或未知的因素，事事要求清晰  人事及权力构架必须清晰，规则更加要清楚  
 
遇到人际冲突，最邓公开解决，猜度会产生焦虑  澶于洞悉别人的动机  
赞誉的说话最好有根有据     
';
break;
case 8:
  echo '
如何识别型号：8   
保持独特是很重要的  
必须经常接触到真正的内在感受  
不喜欢枯燥无味的工作，喜欢有意义的工作  对肤浅的人感到不耐烦  凡事追求深层的意义  
在个人生活及工作上都找寻方式去表达创意  具有良好的审美眼光，善于美化环境  能够感同身受  
有时情绪化，对情绪平稳的人会造成困扰     
';
break;
case 9:
  echo '
如何识别型号：9 
是行业中的专家，善于设计策略  喜爱学习及囤积知识  
容易掌握概念，而对人的知识却相当贫乏  
注重个人空间及时间，与人相处太久会产生疲累感  当有充分的准备时，可成为出色的导师  是上佳的观察家，是生命的旁观者  
不会贸贸然参予他人的活动，因为必须保存个人的资源  
可以长时期单独工作，被人认为为人退缩及不愿意支持别人  绝对自给自足，又能自我推动  拥有丰富的内在世界
';
break;
}